/*
Змінна
ключове слово імʼя змінної

var - deprecated
let - читати і записувати
const - читати

*/

let box;

// "=" оператор присвоєння

box=3; //операція присваювання

console.log(box); //3

//Молжемо визначати значення змінної при створенні

let box2="Hello world";

console.log(box2);

box2=236

console.log(box2);//236

let isActive = true;
let islogged = false

//Присвоення значення із іншої змінної

let x=10;
let y=x;
console.log(y)  //10
/*
    Правила неймінгу змінних

    1.Вікористовуйте осмісленні та описові імена змінніх
    Наприклад:
     userName, age, totalCase
     2.Використовуйте  camelCase у JS

     3.Уникайте використання однобуквенних або непояснювальніх скорочень
     Наприклад:

     x, y, zxc

     4. Уникайте пробілів та спеціальних символів у назвах змінних.
     5. Заборонено починати назву змінної з цифри


    */