const schedule = new Map();

schedule.set('Понеділок',['Математика','физика'])
schedule.set('Вівторок',['Алгебра','Геометрія'])
schedule.set('Середа',['Англійська мова','Фізкультура'])
schedule.set('Четвер',['Праця','укр.мова'])
schedule.set('пятниця',['Література','фізра'])


//Отримання розкладу занять для певного дня
console.log(schedule.get('Понеділок'))

//Перевірка чи є розклад для певного дня
console.log(schedule.has('сУБОТА'))

//оТРИМАННЯ КІЛЬКОСТІ ЗАНЯТЬ В розкладі
console.log(schedule.size);