// array.concat - використовується для об'єднання двох або більше масивів у новий масив (немутуючий)
// array.fill - використовується для заповнення всіх елементів масиву якимсь одним значенням (мутуючий)
// array.includes - використовується для перевірки наявності певного значення у масиві (немутуючий)
// array.indexOf - використовується для отримання першого входження певного значення у масиві (немутуючий)
// array.join - використовується для створення рядка, об'єднуючи всі елементи масиву (немутуючий)
// array.push - використовується для додавання одного або кількох елементів у кінець (мутуючий)
// array.pop - використовується для видалення останнього елементу (мутуючий
// array.shift - використовується для видалення першого елементу з початку масиву (мутуючий)
// array.unshift - використовується для додавання одного або декількох елементів на початок масиву (мутуючий)
// array.unshift(element1, element2, ..., elementN)
// array.reverse - використовується для зміни порядку елементів у масиві на протилежний (мутуючий)
// Методи, які змінюють вихідний масив - мутуючі методи
// Методи, які НЕ змінюють вихідний масив - немутуючі методи (більшість методів масиву)
// array.slice - використовується для сворення нового масиву який складається з якоїсь певної кількості частин вихідного масиву
// array.slice(start, end) - старт включно, енд не включно


const users=[{
    name: 'John',
    lastName: 'Doe'
},{
    name: 'Jane',
    lastName: 'Doe'
},{
    name: 'Jack',
    lastName: 'Dosh'
}

]

const newUsers = users.slice() //Поверхнева копія

newUsers[0].name = 'Alex'